tests/data/webhooks/payments.seized.json

{
    "id": "wh_mKq34DEk15Jy0aX",
    "object": "webhook",
    "name": "payments.seized",
    "data": {
        "payment": {
            "id": "pay_WNgOL28rEdX47wP",
            "amount": 1.5,
            "object": "payment",
            "status": "compliance",
            "sub_status": "seized",
            "fiat_amount": 1.5,
            "created_date": 1665645393,
            "confirmed_date": 1665645693,
            "currency_code": "USDC",
            "currency": {
                "id": "cur_OZxelV2Bg5EoAQ0",
                "object": "currency",
                "code": "USDC",
                "blockchain": "ethereum",
                "coin_type": "erc20"
            },
            "fiat_currency_code": "USD"
        },
        "session": {
            "id": "ses_7vJaZ5m8O21EoY3",
            "object": "session",
            "status": "compliance",
            "payment_type": "recurring",
            "customer": {
                "id": "cus_gP8N9l23JD36Lbm",
                "email": "john.doe@example.com",
                "object": "customer",
                "last_name": null,
                "first_name": "John"
            },
            "order_id": "1234",
            "order_name": "Premium",
            "fiat_amount": 1.5,
            "created_date": 1665645049,
            "fiat_currency_code": "USD"
        },
        "payment_intent": {
            "id": "pi_ZPvXVDRmWdOnwR4",
            "amount": 1.5,
            "object": "payment_intent",
            "status": "compliance",
            "customer": {
                "id": "cus_gP8N9l23JD36Lbm",
                "email": "john.doe@example.com",
                "object": "customer",
                "last_name": "Doe",
                "first_name": "John"
            },
            "payments": [
                {
                    "id": "pay_WNgOL28rEdX47wP",
                    "amount": 1.5,
                    "object": "payment",
                    "status": "compliance",
                    "sub_status": "seized",
                    "fiat_amount": 1.5,
                    "created_date": 1665645393,
                    "confirmed_date": 1665645693,
                    "currency_code": "USDC",
                    "currency": {
                        "id": "cur_OZxelV2Bg5EoAQ0",
                        "object": "currency",
                        "code": "USDC",
                        "blockchain": "ethereum",
                        "coin_type": "erc20"
                    },
                    "fiat_currency_code": "USD"
                }
            ],
            "fiat_amount": 1.5,
            "paid_amount": 1.5,
            "created_date": 1665645103,
            "currency_code": "USDC",
            "currency": {
                "id": "cur_OZxelV2Bg5EoAQ0",
                "object": "currency",
                "code": "USDC",
                "blockchain": "ethereum",
                "coin_type": "erc20"
            },
            "exchange_rate": 1,
            "paid_fiat_amount": 1.5,
            "issued_wallet": null,
            "fees": {
                "object": "fee",
                "amount": 0.01,
                "fiat_amount": 0,
                "currency": {
                    "id": "cur_OZxelV2Bg5EoAQ0",
                    "object": "currency",
                    "code": "USDT",
                    "blockchain": "ethereum",
                    "coin_type": "erc20"
                },
                "fiat_currency_code": "USD"
            }
        }
    }
}
